{
    "movies": [{
            "uuid":"202101",
            "title": "A Star Is Born",
            "director": "Bradley Cooper",
            "poster": "@drawable/poster_one",
            "age": "R",
            "genre": "Drama, Percintaan, Musik",
            "duration": "2H16M",
            "rating": 75,
            "category": "movie",
            "release_date":"3/10/2018",
            "synopsis": "Seorang bintang musik country yang karirnya mulai memudar,Jackson Maine (Bradley Cooper) menemukan sebuah talenta yang sangat berbakat di dalam diri dari seorang musisi muda bernama Ally (Lady Gaga). Maine berhasil mengorbitkan Ally menjadi seorang bintang muda yang menjanjikan. Namun keduanya terlibat hubungan yang lebih jauh dari sekedar mentor dan anak didik. Seiring dengan meroketnya karir dari Ally dan dirinya, Maine mengalami dilema mengenai masalah ini."
        },
        {
            "uuid":"202102",
            "title": "Alita: Battle Angel",
            "director": "Robert Rodriguez",
            "poster": "@drawable/poster_two",
            "age": "PG-13",
            "genre": "Aksi, Cerita Fiksi, Petualangan",
            "duration": "2H2M",
            "rating": 72,
            "category": "movie",
            "release_date":"14/02/2019",
            "synopsis": "Ketika Alita terbangun tanpa ingatan tentang siapa dia di dunia masa depan yang tidak dia kenal, dia ditangkap oleh Ido, seorang dokter yang penuh kasih yang menyadari bahwa di suatu tempat dalam cangkang cyborg yang ditinggalkan ini adalah hati dan jiwa seorang wanita muda dengan luar biasa. lalu."
        },
        {
            "uuid":"202103",
            "title": "Aquaman",
            "director": "James Wan",
            "poster": "@drawable/poster_three",
            "age": "PG-13",
            "genre": "Aksi, Petualangan, Fantasi",
            "duration": "2H23M",
            "rating": 69,
            "category": "movie",
            "release_date":"7/12/2018",
            "synopsis": "Dulunya rumah bagi peradaban paling maju di Bumi, Atlantis sekarang menjadi kerajaan bawah air yang diperintah oleh Raja Orm yang haus kekuasaan. Dengan pasukan besar yang dimilikinya, Orm berencana untuk menaklukkan orang-orang samudra yang tersisa dan kemudian dunia permukaan. Yang menghalangi jalannya adalah Arthur Curry, saudara setengah manusia Orm, saudara setengah Atlantis dan pewaris sejati takhta."
        },
        {
            "uuid":"202104",
            "title": "Bohemian Rhapsody",
            "director": "Brayn Singer",
            "poster": "@drawable/poster_four",
            "age": "PG-13",
            "genre": "Musik, Drama, Sejara",
            "duration": "2H15M",
            "rating": 80,
            "category": "movie",
            "release_date":"02/11/2018",
            "synopsis": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess."
        },
        {
            "uuid":"202105",
            "title": "Cold Pursuit",
            "director": "Hans Petter Moland",
            "poster": "@drawable/poster_five",
            "age": "R",
            "genre": "Aksi, Kejahatan, Cerita Seru",
            "duration": "1H59M",
            "rating": 57,
            "category": "movie",
            "release_date":"08/02/2019",
            "synopsis": "The quiet family life of Nels Coxman, a snowplow driver, is upended after his son's murder. Nels begins a vengeful hunt for Viking, the drug lord he holds responsible for the killing, eliminating Viking's associates one by one. As Nels draws closer to Viking, his actions bring even more unexpected and violent consequences, as he proves that revenge is all in the execution."
        },
        {
            "uuid":"202106",
            "title": "Creed",
            "director": "Ryan Coolger",
            "poster": "@drawable/poster_six",
            "age": "PG-13",
            "genre": "Drama",
            "duration": "2H13M",
            "rating": 74,
            "category": "movie",
            "release_date":"25/11/2015",
            "synopsis": 12
        },
        {
            "uuid":"202107",
            "title": "The Crimes Of Grindelwald",
            "director": "David Yates",
            "poster": "@drawable/poster_seven",
            "age": "PG-13",
            "genre": "Petualangan, Fantasi, Drama",
            "duration": "1H22M",
            "rating": 75,
            "category": "movie",
            "release_date":"16/11/2018",
            "synopsis": 12
        },
        {
            "uuid":"202108",
            "title": "Glass",
            "director": "M. Night Shyamalan",
            "poster": "@drawable/poster_eight",
            "age": "PG-13",
            "genre": "Cerita Seru, Drama, Cerita Fiksi",
            "duration": "2H9M",
            "rating": 67,
            "category": "movie",
            "release_date":"18/01/2019 ",
            "synopsis": "In a series of escalating encounters, former security guard David Dunn uses his supernatural abilities to track Kevin Wendell Crumb, a disturbed man who has twenty-four personalities. Meanwhile, the shadowy presence of Elijah Price emerges as an orchestrator who holds secrets critical to both men."
        },
        {
            "uuid":"202109",
            "title": "Infinity War",
            "director": "Joe Russo",
            "poster": "@drawable/poster_nine",
            "age": "PG-13",
            "genre": "Petualangan, Aksi, Cerita Fiksi",
            "duration": "2H29M",
            "rating": 83,
            "category": "movie",
            "release_date":"27/04/2018",
            "synopsis": "Karena Avengers dan sekutunya terus melindungi dunia dari ancaman yang terlalu besar untuk ditangani oleh seorang pahlawan, bahaya baru telah muncul dari bayangan kosmik: Thanos. Seorang lalim penghujatan intergalaksi, tujuannya adalah untuk mengumpulkan semua enam Batu Infinity, artefak kekuatan yang tak terbayangkan, dan menggunakannya untuk menimbulkan kehendak memutar pada semua realitas. Segala sesuatu yang telah diperjuangkan oleh Avengers telah berkembang hingga saat ini - nasib Bumi dan keberadaannya sendiri tidak pernah lebih pasti."
        },
        {
            "uuid":"202110",
            "title": "Master Z: IP Man Legacy",
            "director": "Yuen Woo-ping",
            "poster": "@drawable/poster_ten",
            "age": "R",
            "genre": "Aksi",
            "duration": "1H47M",
            "rating": 60,
            "category": "movie",
            "release_date":"17/02/2018",
            "synopsis": "Following his defeat by Master Ip, Cheung Tin Chi tries to make a life with his young son in Hong Kong, waiting tables at a bar that caters to expats. But it's not long before the mix of foreigners, money, and triad leaders draw him once again to the fight."
        }
    ]
}